app/views/devise/sessions/new.html.erb

SELECT COUNT(*) FROM `users`
---
                    <div class="form-group">
                      <% if User.count.zero? %>