app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT `areas`.* FROM `areas`

  def new
    @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
    @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }
---
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1

  def edit
    @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
    @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }
---
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1

  def create
    @area = Area.new(area_params)
    unless current_user.nil?
      @area.created_user_id = current_user.id
    end
    respond_to do |format|
      if @area.save
        format.html { redirect_to @area, notice: 'El Área se creó correctamente.' }
        format.json { render :show, status: :created, location: @area }
      else
        @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
        @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }
---
INSERT INTO `areas` (`activo`, `area`, `created_at`, `created_user_id`, `customer_company_id`, `descripcion`, `orden`, `updated_at`) VALUES (1, 'Direccion General', '2015-07-28 00:36:05', 2, 1, 'Dirección General', 1, '2015-07-28 00:36:05')
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1

  def destroy
    @area.destroy
---
DELETE FROM `areas` WHERE `areas`.`id` = 2

    def set_area
      @area = Area.find(params[:id])
---
SELECT  `areas`.* FROM `areas`  WHERE `areas`.`id` = 2 LIMIT 1