app/controllers/customer_companies_controller.rb

SELECT `customer_companies`.* FROM `customer_companies`
---
  def index
    @customer_companies = CustomerCompany.all

SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1 AND `customer_companies`.`consorcio` = 1
---
  def new
    @customer_company_options = CustomerCompany.where(activo: true, consorcio: true).map{|m| [ m.empresa_cliente , m.id ] }

SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1 AND `customer_companies`.`consorcio` = 1
---
  def edit
    @customer_company_options = CustomerCompany.where(activo: true, consorcio: true).map{|m| [ m.empresa_cliente , m.id ] }

INSERT INTO `customer_companies` (`activo`, `consorcio`, `created_at`, `created_user_id`, `customer_companies_id`, `empresa_cliente`, `razon_social`, `rfc`, `updated_at`) VALUES (1, 1, '2015-07-08 19:50:10', 2, 3, 'PATITO 2000', 'PATITO 200 S.A. DE C.V.', 'PAT000101', '2015-07-08 19:50:10')
---
  def create
    @customer_company = CustomerCompany.new(customer_company_params)
    @customer_company.created_user_id = current_user.id

UPDATE `customer_companies` SET `Consorcio` = 0, `EmpresaCliente` = 'INTESO', `EmpresaCliente_id` = NULL, `RazonSocial` = 'inteso', `Rfc` = 'RFC', `updated_at` = '2015-07-08 03:14:08' WHERE `customer_companies`.`id` = 1
---
  def update
    @customer_company.updated_user_id = current_user.id

DELETE FROM `customer_companies` WHERE `customer_companies`.`id` = 2
---
  def destroy
    @customer_company.destroy

SELECT  `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`id` = 3 LIMIT 1
---
    def set_customer_company
      @customer_company = CustomerCompany.find(params[:id])