app/controllers/menu_options_controller.rb

  def index
    @menu_options = MenuOption.all
---
SELECT `menu_options`.* FROM `menu_options`

  def new
    @menu_options_options = MenuOption.where(activo: true).map{|m| [ m.modulo , m.id ] }
---
SELECT `menu_options`.* FROM `menu_options`  WHERE `menu_options`.`activo` = 1

  def edit
    @menu_options_options = MenuOption.where(activo: true).map{|m| [ m.modulo , m.id ] }
---
SELECT `menu_options`.* FROM `menu_options`  WHERE `menu_options`.`activo` = 1

  def create
    @menu_option = MenuOption.new(menu_option_params)
    unless current_user.nil?
      @menu_option.created_user_id = current_user.id
    end
    respond_to do |format|
      if @menu_option.save
        format.html { redirect_to @menu_option, notice: 'El Módulo se creó correctamente.' }
        format.json { render :show, status: :created, location: @menu_option }
      else
        @menu_options_options = MenuOption.where(activo: true).map{|m| [ m.modulo , m.id ] }
---
INSERT INTO `menu_options` (`Activo`, `Consorcio`, `Descripcion`, `Imagen`, `Modulo`, `Modulo_id`, `Orden`, `Ruta`, `UsuarioAlta_id`, `created_at`, `updated_at`) VALUES (1, 0, 'Administración de los módulos del sistema', '', 'Módulos', 2, 1, 'menu_options_path', 2, '2015-07-08 07:02:29', '2015-07-08 07:02:29')
SELECT `menu_options`.* FROM `menu_options`  WHERE `menu_options`.`activo` = 1

  def update
    unless current_user.nil?
      @menu_option.updated_user_id = current_user.id
    end
    respond_to do |format|
      if @menu_option.update(menu_option_params)
        format.html { redirect_to @menu_option, notice: 'El Módulo se actualizo correctamente.' }
        format.json { render :show, status: :ok, location: @menu_option }
      else
        @menu_options_options = MenuOption.where(activo: true).map{|m| [ m.modulo , m.id ] }
---
UPDATE `menu_options` SET `descripcion` = 'Otro modulo', `updated_at` = '2015-08-02 04:15:32', `updated_user_id` = 2 WHERE `menu_options`.`id` = 7
SELECT `menu_options`.* FROM `menu_options`  WHERE `menu_options`.`activo` = 1

  def destroy
    @menu_option.destroy
---
DELETE FROM `menu_options` WHERE `menu_options`.`id` = 1

    def set_menu_option
      @menu_option = MenuOption.find(params[:id])
---
SELECT  `menu_options`.* FROM `menu_options`  WHERE `menu_options`.`id` = 3 LIMIT 1