app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles`
---
  def index
    @roles = Role.all

SELECT `customer_companies`.* FROM `customer_companies`  WHERE (activo = 1)
---
  def new
    #@role = Role.new
    #respond_with(@role)
    @roles_companies_options = CustomerCompany.where("activo = 1").map{|m| [ m.empresa_cliente , m.id ] }

INSERT INTO `roles` (`activo`, `created_at`, `created_user_id`, `descripcion`, `rol`, `updated_at`) VALUES (1, '2015-07-14 00:55:14', 1, 'rol de super usuario', 'administrador', '2015-07-14 00:55:14')
---
  def create
    @role = Role.new(role_params)
    flash[:notice] = 'Role was successfully created.' if @role.save

UPDATE `roles` SET `descripcion` = 'rol agregado recientemente editado', `updated_at` = '2015-07-14 00:20:05', `updated_user_id` = 1 WHERE `roles`.`id` = 1
---
  def update
    flash[:notice] = 'Role was successfully updated.' if @role.update(role_params)

DELETE FROM `roles` WHERE `roles`.`id` = 1
---
  def destroy
    @role.destroy

SELECT  `roles`.* FROM `roles`  WHERE `roles`.`id` = 1 LIMIT 1
---
    def set_role
      @role = Role.find(params[:id])