app/controllers/users_controller.rb

  def new
    @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
    @workplaces_options = Workplace.where(activo: true).map{|m| [ m.puesto , m.id ] }
---
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `workplaces`.* FROM `workplaces`  WHERE `workplaces`.`activo` = 1

  def edit
    @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
    @workplaces_options = Workplace.where(activo: true).map{|m| [ m.puesto , m.id ] }
---
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `workplaces`.* FROM `workplaces`  WHERE `workplaces`.`activo` = 1

  def create
    @user = User.new(user_params)
    unless current_user.nil?
      @user.created_user_id = current_user.id
    end
    respond_to do |format|
      if @user.save
        format.html { redirect_to @user, notice: 'El Usuario se creó correctamente.' }
        format.json { render :show, status: :created, location: @user }
      else
        @customer_companies_options = CustomerCompany.where(activo: true).map{|m| [ m.empresa_cliente , m.id ] }
        @workplaces_options = Workplace.where(activo: true).map{|m| [ m.puesto , m.id ] }
---
INSERT INTO `users` (`ApellidoMaterno`, `ApellidoPaterno`, `Consorcio`, `Curp`, `EmpresaCliente_id`, `Nombre`, `Rfc`, `UsuarioAlta_id`, `created_at`, `email`, `encrypted_password`, `updated_at`) VALUES ('Otra', 'Prueba', 0, 'RFCC800101HDFYCS07', 1, 'Usuario', 'RFCC800101', 2, '2015-07-08 06:48:12', 'usuario@mail.com', '$2a$10$ma3b9R7DtJvFj3HABXookuoH./8tt92lrsgBENUmaomQdjp5ItnQG', '2015-07-08 06:48:12')
SELECT `customer_companies`.* FROM `customer_companies`  WHERE `customer_companies`.`activo` = 1
SELECT `workplaces`.* FROM `workplaces`  WHERE `workplaces`.`activo` = 1

  def update
    @user.updated_user_id = current_user.id
---
UPDATE `users` SET `apellido_materno` = 'Gaytan', `apellido_paterno` = 'Hernandez', `consorcio` = 0, `curp` = 'hega721201hgrdjsk0', `encrypted_password` = '$2a$10$pT8KGkcNB5inz2wQIEGeJ.HbjFmbmuK2FNPeZLsR9jSR4JgVyW9tG', `nombre` = 'Arturo', `rfc` = 'hega721201', `updated_at` = '2015-07-10 19:31:39', `updated_user_id` = 1 WHERE `users`.`id` = 1

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1