app/controllers/workplaces_controller.rb

SELECT `workplaces`.* FROM `workplaces`
---
  def index
    @workplaces = Workplace.all

SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1
---
  def new
    @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }

SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1
---
  def edit
    @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }

INSERT INTO `workplaces` (`Activo`, `Area_id`, `Descripcion`, `EmpresaCliente_id`, `NivelUsuario`, `Puesto`, `created_at`, `updated_at`) VALUES (1, 1, 'Director general', 1, 1, 'Director General', '2015-07-07 22:08:36', '2015-07-07 22:08:36')
SELECT `areas`.* FROM `areas`  WHERE `areas`.`activo` = 1
---
  def create
    @workplace = Workplace.new(workplace_params)
    unless current_user.nil?
      @workplace.created_user_id = current_user.id
    end
    respond_to do |format|
      if @workplace.save
        format.html { redirect_to @workplace, notice: 'El Puesto se creó correctamente.' }
        format.json { render :show, status: :created, location: @workplace }
      else
        @areas_options = Area.where(activo: true).map{|m| [ m.area , m.id ] }

UPDATE `workplaces` SET `descripcion` = 'hacer de todo un poco y un poco más', `updated_at` = '2015-08-02 08:33:30', `updated_user_id` = '2' WHERE `workplaces`.`id` = 4
---
  def update
    unless current_user.nil?
      @workplace.updated_user_id = current_user.id

DELETE FROM `workplaces` WHERE `workplaces`.`id` = 1
---
  def destroy
    @workplace.destroy

SELECT  `workplaces`.* FROM `workplaces`  WHERE `workplaces`.`id` = 1 LIMIT 1
---
    def set_workplace
      @workplace = Workplace.find(params[:id])